revert architecture to ascii
